/* допишіть ваш код під коментарями із 🔸 */

// ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦
// 📝 ЗАВДАННЯ 2.1 Індекси
// ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦

/* Приклад: будинок */
map[2][2] = "🏡";

/* 🔸 1. соняхи 🔸 */
map[1][1] = "🌻";
map[2][1] = "🌻";
map[2][3] = "🌻";
map[3][3] = "🌻";

/* 🔸 2. гори 🔸 */
map[1][4] = "🏔️";
map[2][4] = "🏔️";
map[3][4] = "🏔️";

/* 🔸 3. сімʼя фермерів 🔸 */
map[1][0] = "🧑‍🌾";
map[2][0] = "👩‍🌾";
map[3][0] = "👨‍🌾";

// ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦
// 📝 ЗАВДАННЯ 2.2 Методи масивів
// ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦

/* 🔸 4. тварини 🔸 */
map.shift();
map.unshift(["🐄", "🐏", "🐖", "🐓", "🐈‍"]);

/* 🔸 5. ліс 🔸 */
map.pop();
map.push(["🌲", "🌲", "🌲", "🌲", "🌲"]);

/* 🔸 6. тюльпани 🔸 */
map[1].splice(2, 2, "🌷", "🌷");
map[3].splice(1, 2, "🌷", "🌷");

// ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦ - ✦
/* Виклик функції, яка малює мапу */
drawMap();
